
## Plan Result

[CI link](https://github.com/enokawa/terraform-sandbox/actions/runs/4761053532)


<pre><code>Plan: 13 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.vpc.aws_route_table.private_1
  * module.vpc.aws_route_table.protected_1
  * module.vpc.aws_route_table.protected_2
  * module.vpc.aws_route_table.public_1
  * module.vpc.aws_route_table_association.private_1
  * module.vpc.aws_route_table_association.private_2
  * module.vpc.aws_route_table_association.protected_1
  * module.vpc.aws_route_table_association.protected_2
  * module.vpc.aws_route_table_association.public_1
  * module.vpc.aws_route_table_association.public_2
  * module.vpc.aws_subnet.private_1
  * module.vpc.aws_subnet.private_2
  * module.vpc.aws_subnet.protected_2


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vpc.aws_route_table.private_1 will be created
  + resource "aws_route_table" "private_1" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev-sandbox-private-1"
        }
      + tags_all         = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-private-1"
          + "ProjectName" = "sandbox"
        }
      + vpc_id           = "vpc-04aede4e87135b698"
    }

  # module.vpc.aws_route_table.protected_1 will be created
  + resource "aws_route_table" "protected_1" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0fca2384d9bb442ef"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "dev-sandbox-protected-1"
        }
      + tags_all         = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-protected-1"
          + "ProjectName" = "sandbox"
        }
      + vpc_id           = "vpc-04aede4e87135b698"
    }

  # module.vpc.aws_route_table.protected_2 will be created
  + resource "aws_route_table" "protected_2" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0fca2384d9bb442ef"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "dev-sandbox-protected-2"
        }
      + tags_all         = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-protected-2"
          + "ProjectName" = "sandbox"
        }
      + vpc_id           = "vpc-04aede4e87135b698"
    }

  # module.vpc.aws_route_table.public_1 will be created
  + resource "aws_route_table" "public_1" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0fca2384d9bb442ef"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "dev-sandbox-public-1"
        }
      + tags_all         = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-public-1"
          + "ProjectName" = "sandbox"
        }
      + vpc_id           = "vpc-04aede4e87135b698"
    }

  # module.vpc.aws_route_table_association.private_1 will be created
  + resource "aws_route_table_association" "private_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private_2 will be created
  + resource "aws_route_table_association" "private_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.protected_1 will be created
  + resource "aws_route_table_association" "protected_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0b134a05cd4b084e1"
    }

  # module.vpc.aws_route_table_association.protected_2 will be created
  + resource "aws_route_table_association" "protected_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_1 will be created
  + resource "aws_route_table_association" "public_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-034b1b82eebfe098a"
    }

  # module.vpc.aws_route_table_association.public_2 will be created
  + resource "aws_route_table_association" "public_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0d125e642f2585b59"
    }

  # module.vpc.aws_subnet.private_1 will be created
  + resource "aws_subnet" "private_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.128.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-sandbox-private-1"
        }
      + tags_all                                       = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-private-1"
          + "ProjectName" = "sandbox"
        }
      + vpc_id                                         = "vpc-04aede4e87135b698"
    }

  # module.vpc.aws_subnet.private_2 will be created
  + resource "aws_subnet" "private_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.144.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-sandbox-private-2"
        }
      + tags_all                                       = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-private-2"
          + "ProjectName" = "sandbox"
        }
      + vpc_id                                         = "vpc-04aede4e87135b698"
    }

  # module.vpc.aws_subnet.protected_2 will be created
  + resource "aws_subnet" "protected_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-sandbox-protected-2"
        }
      + tags_all                                       = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-protected-2"
          + "ProjectName" = "sandbox"
        }
      + vpc_id                                         = "vpc-04aede4e87135b698"
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":7,"Program":"tfcmt","SHA1":"e13887860d6993c2cef8274cbfe82f349ce8a5e4","Vars":{},"WorkflowName":"Terraform Plan (develop)"} -->